Cats/app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
    def new
        @cats = Cat.all

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date") VALUES ($1, $2, $3) RETURNING "id"  [["cat_id", 1], ["start_date", "2021-05-02"], ["end_date", "2021-05-18"]]
---
    def create
        new_req = CatRentalRequest.new(cat_request_params(params))
        if new_req.save

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def edit
        @cat_rental_request = CatRentalRequest.find(params[:id])
        @cat = Cat.find(@cat_rental_request.id)