Cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 LIMIT $2  [["cat_id", 1], ["LIMIT", 1]]
---
    def show
        @cat = Cat.find(params[:id])
        @requests = CatRentalRequest.find_by(cat_id: @cat.id)

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @cat = Cat.create!(cat_params(params))

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "I am rabbit"], ["updated_at", "2021-05-27 20:21:46.524534"], ["id", 3]]
---
    def update
        cat = Cat.find(params[:id])
        if cat.update(cat_params(params))